---
kind: property
id: P:Autodesk.Revit.DB.TilePattern.TilesPerSeedNode
source: html/daa137f9-ca93-0838-9c65-4d49955c066b.htm
---
# Autodesk.Revit.DB.TilePattern.TilesPerSeedNode Property

Get the number of tiles located at each seed node.

## Syntax (C#)
```csharp
public int TilesPerSeedNode { get; }
```

## Remarks
Currently the number of tiles per seed node is
always either 1 or 2.